load-tests/artillery/caan-dashboard.yml
# Artillery scenario: 10 concurrent CAAN users viewing aggregated cross-tenant
# dashboards. Requires a CAAN_SMD (or SUPER_ADMIN) Firebase ID token.
#
# Run:
#   LOADTEST_TOKEN=$(node load-tests/get-token.mjs <caan-email> <password>)
#   artillery run load-tests/artillery/caan-dashboard.yml

config:
  target: "https://sms-aviasafesystems-beta.onrender.com"
  phases:
    - duration: 120
      arrivalRate: 1
      maxVUs: 10
      name: "10 concurrent CAAN users"
  ensure:
    p95: 500
  defaults:
    headers:
      Authorization: "Bearer {{ process.env.LOADTEST_TOKEN }}"

scenarios:
  - name: "Load CAAN aggregated dashboard"
    flow:
      - get:
          url: "/api/dashboard/caan/overview"
      - get:
          url: "/api/dashboard/caan/trends"
      - get:
          url: "/api/dashboard/caan/risk"
      - get:
          url: "/api/dashboard/caan/hazards"
      - get:
          url: "/api/dashboard/caan/survey-maturity"
      - get:
          url: "/api/dashboard/caan/sms-maturity-assessment"
      - get:
          url: "/api/dashboard/caan/benchmark"
      - think: 2