load-tests/artillery/dashboard-view.yml
# Artillery scenario: 50 concurrent users viewing airline dashboards.
# Dashboard GET endpoints are NOT rate-limited, so this is a clean latency test.
#
# Run:
#   LOADTEST_TOKEN=$(node load-tests/get-token.mjs safety@tara-air.com 'TARA-Safety-2026')
#   artillery run load-tests/artillery/dashboard-view.yml

config:
  target: "https://sms-aviasafesystems-beta.onrender.com"
  phases:
    - duration: 120
      arrivalRate: 2
      maxVUs: 50
      name: "50 concurrent dashboard viewers"
  ensure:
    p95: 500
  defaults:
    headers:
      Authorization: "Bearer {{ process.env.LOADTEST_TOKEN }}"

scenarios:
  - name: "Load airline dashboard"
    flow:
      - get:
          url: "/api/dashboard/overview?days=90"
      - get:
          url: "/api/dashboard/trends?days=180"
      - get:
          url: "/api/dashboard/hazards?days=90"
      - get:
          url: "/api/dashboard/actions?days=90"
      - get:
          url: "/api/dashboard/airline/sms-maturity?days=365"
      - think: 1