load-tests/artillery/report-submission.yml
# Artillery scenario: 100 concurrent users submitting voluntary safety reports.
#
# NOTE ON RATE LIMITING: /api/reports/vsr is throttled to 50/day per tenant.
# Once the limit is exhausted, requests are (correctly) rejected with HTTP 429.
# 429 responses are fast, so the p95 < 500ms success criterion still holds, but
# for a pure performance run disable rate limiting on the target backend
# (unset REDIS_URL / set REDIS_ENABLED=false) before running.
#
# Run:
#   LOADTEST_TOKEN=$(node load-tests/get-token.mjs safety@tara-air.com 'TARA-Safety-2026')
#   artillery run load-tests/artillery/report-submission.yml

config:
  target: "https://sms-aviasafesystems-beta.onrender.com"
  phases:
    - duration: 120
      arrivalRate: 5
      maxVUs: 100
      name: "100 concurrent reporters"
  ensure:
    p95: 500
  defaults:
    headers:
      Authorization: "Bearer {{ process.env.LOADTEST_TOKEN }}"
      Content-Type: "application/json"

scenarios:
  - name: "Submit voluntary safety report"
    flow:
      - post:
          url: "/api/reports/vsr"
          json:
            report_type: voluntary
            is_anonymous: false
            narrative: "Load test VSR {{ $uuid }}: crew reported go-around after unstable approach, tower visibility degraded during final phase of the sector."
            location: "Kathmandu TIA"
            occurrence_date: "{{ $isoTimestamp }}"
            severity_level: 3
            probability_level: 2
            occurrence_category: "Airborne"
      - think: 1